/*
一.做一套python练习题
{
1.软件工程包括三个要素：方法、工具和过程。

2.在软件详细设计阶段,常用的图形描述工具有程序流程图,盒图(NS 图)和问题分析图(PAD) .

	常用的语言描述工具为 PDL(程序设计语言) ,常用的表格描述工具有判定表和判定树.

3.设 x = "alice"；y = "kate"，执行x,y = y,x可以实现变量 x 和 y 值的互换

4.0x-16进制，0b-2进制，0o-8进制，0d-10进制

5.数据的逻辑结构有线性结构和非线性结构两大类

6.对长度为n的线性表进行顺序查找，在最坏的情况下所需要的比较次数是n:对于所要查找的元素，与表中的数据逐个比对

7.Python 语言中，复数类型中实数部分和虚数部分的数值都是浮点类型，复数的虚数部分通过后缀“J”或者“j”来表示

8.continue语句的意思是,放弃当前循环中continue后面的语句,而继续进行当前循环的下一次循环,它跳不出当前循环.

9.python 读写文件，统计词语个数

}

二.数据结构学习：
{
1.linux内核链表
2.传智1-12看完
}






*/